Revit 2027 API
FabricSheet.IsValidHost(Document, ElementId) Method
 Checks whether an element is a valid host for fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidHost(
	Document document,
	ElementId concreteHostElementId
)
Public Shared Function IsValidHost (
	document As Document,
	concreteHostElementId As ElementId
) As Boolean
public:
static bool IsValidHost(
	Document^ document,
	ElementId^ concreteHostElementId
)
static member IsValidHost :
        document : Document *
        concreteHostElementId : ElementId -> bool
Parameters
document Document
 The document.
concreteHostElementId ElementId
 The elementId to check.
Return Value
Boolean
 True if the element is a valid host for fabric sheet, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricSheet Class
IsValidHost Overload
Autodesk.Revit.DB.Structure Namespace